%多元线性回归
%数据输入
x1=[5.5 2.5 8.0 3.0 3.0 2.9 8.0 9.0 4.0 6.5 5.5 5.0 6.0 5.0 3.5 8.0 6.0 4.0 7.5 7.0]';
x2=[31 55 67 50 38 71 30 56 42 73 60 44 50 39 55 70 40 50 62 59]';
x3=[10 8 12 7 8 12 12 5 8 5 11 12 6 10 10 6 11 11 9 9]';
x4=[8 6 9 16 15 17 8 10 4 16 7 12 6 4 4 14 6 8 13 11]';
y=[79.3 200.1 163.2 200.1 146.0 177.7 30.9 291.9 160.0 339.4 159.6 86.3 237.5 107.2 ...
    155.0 201.4 100.2 135.8 223.3 195.0]';
X=[ones(size(x1)) x1 x2 x3 x4];
%进行多元线性回归分析
[b,bint,r,rint,stats]=regress(y,X)
%绘制残差图
figure(1)
rcoplot(r,rint)
%% 逐步线性回归
%数据输入
x1=[7 1 11 11 7 11 3 1 2 21 1 11 10]';
x2=[26 29 56 31 52 55 71 31 54 47 40 66 68]';
x3=[6 15 8 8 6 9 17 22 18 4 23 9 8]';
x4=[60 52 20 47 33 22 6 44 22 26 34 12 12]';
y=[78.5 74.3 104.3 87.6 95.9 109.2 102.7 72.5 93.1 115.9 83.8 113.3 109.4]';
x=[x1 x2 x3 x3];
%调用逐步回归函数
stepwise(x,y)
%选用x1、x2进行多元线性回归
x_1=[ones(size(x1)) x1 x2];
[b,bint,r,rint,stats]=regress(y,x_1)
%绘制残差图
figure(2)
rcoplot(r,rint)
%绘制平面图
[X1,X2]=meshgrid(x1,x2);%创建网格点坐标矩阵
z=b(1)+b(2)*X1+b(3)*X2;
figure(3)
surf(x1,x2,z)
xlabel('x1')
ylabel('x2')
zlabel('z')
title(['z=' num2str(b(1)) '+' num2str(b(2)) '*x1+' num2str(b(3)) '*x2'])
